lis = [2,3,'k',['qwe',20,['k',['tt',3,'1']],89],'ab','adv']
# 1)将列表lis中的’tt’变成大写（用两种方式）。
print(lis[3][2][1][0].upper())
lis[3][2][1][0] = 'TT'
print(lis)

# 2)将列表中的数字3变成字符串’100’（用两种方式）。
print(lis[3][3])
# lis[3][3] = 100
lis[3][3] = lis[3][3] + 11
print(lis)

# 3)将列表中的字符串’1’变成数字101（用两种方式）
print(lis[3][2][1][2], type(lis[3][2][1][2]))
# lis[3][2][1][2] = 101
# lis[3][2][1][2] = int(lis[3][2][1][2])+99
lis[3][2][1][2] = int(lis[3][2][1][2] + '00')
# lis[3][2][1][2] = lis[3][2][1][2].replace('1', '100')
print(lis)